"""Создайте список из 10 элементов, вставьте на 3-ю позицию новое значение,
удалите элемент из списка под индексом 6"""

spis1 = [2,8,4,6,11,15,19,10,3,1]
spis1.insert(2,7)
spis1.pop(6)

print(spis1)
